<?php

return [
    'lead_status' => [
        'BP_1' => [
            'id' => 29884039,
        ],
        'BP_2' => [
            'id' => 29884042,
        ],
        'BP_3' => [
            'id' => 29884045,
        ],
    ],
    'element_type' => [
        'contact' => 1,
        'lead' => 2,
        'company' => 3,
        'task' => 4,
    ],
    'note_type' => [
        'default' => '4',
        'task_result' => '13',
        'system_message' => '25',
        'income_sms' => '102',
        'outcome_sms' => '103'
    ],
    'cf' => [
        'contact' => [
            'phone' => [
                'id' => 414507,
                'enums' => [
                    580403 => 'WORK',
                    580405 => 'WORKDD',
                    580407 => 'MOB',
                    580409 => 'FAX',
                    580411 => 'HOME',
                    580413 => 'OTHER',
                ],
            ],
            'email' => [
                'id' => 414509,
                'enums' => [
                    580415 => 'WORK',
                    580417 => 'PRIV',
                    580419 => 'OTHER',
                ],
            ],
            'ads_channel' => [
                'id' => 489005,
                'enums' => [
                    692683 => 'Яндекс Директ',
                    692685 => 'Яндекс Органика',
                    692687 => 'Google Adwords',
                    692689 => 'Google Органика',
                    692691 => 'Mail.ru Реклама',
                    692693 => 'Mail.ru Органика',
                    692695 => 'Vkontakte Реклама',
                    692697 => 'Vkontakte Органика',
                    692699 => 'Facebook Реклама',
                    692701 => 'Facebook Органика',
                    692703 => 'Оk.ru Реклама',
                    692705 => 'Ok.ru Органика',
                    692707 => 'Instagram Реклама',
                    692709 => 'Instagram Органика',
                    692711 => 'Youtube Реклама',
                    692713 => 'Youtube Органика',
                    692715 => 'Аvito Реклама',
                    692717 => 'Рекламный канал Х',
                    692719 => 'Органика канал Х',
                    692721 => 'Прямой заход',
                    692723 => 'Не задан',
                ],
            ],
            'touch' => [
                'id' => 489009,
                'enums' => [
                    692767 => 'Форма на web-сайте',
                    692769 => 'Входящий звонок',
                    692771 => 'Исходящий звонок',
                    692773 => 'Не задан',
                ],
            ],
            'website' => [
                'id' => 489013,
                'enums' => [
                    692783 => 'http://localhost/public/index.php',
                    692785 => 'http://test.goodtechcrm.ru/',
                ],
            ],
            'website_page' => [
                'id' => 489017,
            ],
            'form' => [
                'id' => 489021,
                'enums' => [
                    692791 => 'Заказать звонок',
                    692793 => 'Вопрос менеджеру',
                    692795 => 'Записаться на сеанс',
                    692797 => 'Не определена',
                ],
            ],
            'referrer' => [
                'id' => 489025,
            ],
            'utm_source' => [
                'id' => 489029,
            ],
            'utm_medium' => [
                'id' => 489031,
            ],
            'utm_campaign' => [
                'id' => 489033,
            ],
            'utm_content' => [
                'id' => 489035,
            ],
            'utm_term' => [
                'id' => 489037,
            ],
            'browser' => [
                'id' => 489039,
            ],
            'device' => [
                'id' => 489043,
            ],
            'city' => [
                'id' => 489047,
            ],
            'telephony' => [
                'id' => 489051,
                'enums' => [
                    692807 => 'Мои Звонки',
                    692809 => 'OnlinePBX',
                    692811 => 'Sipuni',
                ],
            ],
            'google_client_id' => [
                'id' => 489055,
            ],
            'yandex_client_id' => [
                'id' => 489059,
            ],
        ],
        'lead' => [
            'ads_channel' => [
                'id' => 489007,
                'enums' => [
                    692737 => 'Vkontakte Реклама',
                    692739 => 'Vkontakte Органика',
                    692741 => 'Facebook Реклама',
                    692743 => 'Facebook Органика',
                    692745 => 'Оk.ru Реклама',
                    692747 => 'Ok.ru Органика',
                    692749 => 'Instagram Реклама',
                    692751 => 'Instagram Органика',
                    692753 => 'Youtube Реклама',
                    692755 => 'Youtube Органика',
                    692757 => 'Аvito Реклама',
                    692759 => 'Рекламный канал Х',
                    692761 => 'Органика канал Х',
                    692763 => 'Прямой заход',
                    692765 => 'Не задан',
                    692725 => 'Яндекс Директ',
                    692727 => 'Яндекс Органика',
                    692729 => 'Google Adwords',
                    692731 => 'Google Органика',
                    692733 => 'Mail.ru Реклама',
                    692735 => 'Mail.ru Органика',
                ],
            ],
            'touch' => [
                'id' => 489011,
                'enums' => [
                    692775 => 'Форма на web-сайте',
                    692777 => 'Входящий звонок',
                    692779 => 'Исходящий звонок',
                    692781 => 'Не задан',
                ],
            ],
            'website' => [
                'id' => 489015,
                'enums' => [
                    692787 => 'http://localhost/public/index.php',
                    692789 => 'http://test.goodtechcrm.ru/',
                ],
            ],
            'website_page' => [
                'id' => 489019,
            ],
            'form' => [
                'id' => 489023,
                'enums' => [
                    692799 => 'Заказать звонок',
                    692801 => 'Вопрос менеджеру',
                    692803 => 'Записаться на сеанс',
                    692805 => 'Не определена',
                ],
            ],
            'referrer' => [
                'id' => 489027,
            ],
            'utm_source' => [
                'id' => 435863,
            ],
            'utm_medium' => [
                'id' => 435865,
            ],
            'utm_campaign' => [
                'id' => 435869,
            ],
            'utm_content' => [
                'id' => 435867,
            ],
            'utm_term' => [
                'id' => 435871,
            ],
            'browser' => [
                'id' => 489041,
            ],
            'device' => [
                'id' => 489045,
            ],
            'city' => [
                'id' => 489049,
            ],
            'telephony' => [
                'id' => 489053,
                'enums' => [
                    692813 => 'Мои Звонки',
                    692815 => 'OnlinePBX',
                    692817 => 'Sipuni',
                ],
            ],
            'google_client_id' => [
                'id' => 489057,
            ],
            'yandex_client_id' => [
                'id' => 489061,
            ],
            'width' => [
                'id' => 435877,
            ],
            'height' => [
                'id' => 435875,
            ],
            'cell_number' => [
                'id' => 435881,
                'enums' =>[
                    615179 => '2 камеры',
                    615181 => '3 камеры',
                ],
            ],
            'profile' => [
                'id' => 435879,
                'enums' =>[
                    615169 => 'REHAU',
                    615171 => 'VEKA',
                    615173 => 'KBE',
                    615175 => 'KBE',
                    615177 => 'SALAMANDER',
                ],
            ],
        ],
    ],
];
